cmsis-svd/cmsis-svd-data/data/Atmel/ATSAMD20E16.svd
               <register>
                  <name>INTENCLR</name>
                  <description>MODE2 Interrupt Enable Clear</description>
                  <addressOffset>0x6</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>ALARM0</name>
                        <description>Alarm 0 Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SYNCRDY</name>
                        <description>Synchronization Ready Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>MODE2 Interrupt Enable Set</description>
                  <addressOffset>0x7</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>ALARM0</name>
                        <description>Alarm 0 Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SYNCRDY</name>
                        <description>Synchronization Ready Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>MODE2 Interrupt Flag Status and Clear</description>
                  <addressOffset>0x8</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>ALARM0</name>
                        <description>Alarm 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SYNCRDY</name>
                        <description>Synchronization Ready</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVF</name>
                        <description>Overflow</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>Status</description>
                  <addressOffset>0xA</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SYNCBUSY</name>
                        <description>Synchronization Busy</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>Debug Control</description>
                  <addressOffset>0xB</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGRUN</name>
                        <description>Run During Debug</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FREQCORR</name>
                  <description>Frequency Correction</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>VALUE</name>
                        <description>Correction Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>SIGN</name>
                        <description>Correction Sign</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CLOCK</name>
                  <description>MODE2 Clock Value</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SECOND</name>
                        <description>Second</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>MINUTE</name>
                        <description>Minute</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>HOUR</name>
                        <description>Hour</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>5</bitWidth>
                        <enumeratedValues>
                           <name>HOURSelect</name>
                           <enumeratedValue>
                              <name>AM</name>
                              <description>AM when CLKREP in 12-hour</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PM</name>
                              <description>PM when CLKREP in 12-hour</description>
                              <value>0x10</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DAY</name>
                        <description>Day</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>MONTH</name>
                        <description>Month</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>YEAR</name>
                        <description>Year</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ALARM</name>
                  <description>MODE2_ALARM Alarm n Value</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SECOND</name>
                        <description>Second</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>MINUTE</name>
                        <description>Minute</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>HOUR</name>
                        <description>Hour</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>5</bitWidth>
                        <enumeratedValues>
                           <name>HOURSelect</name>
                           <enumeratedValue>
                              <name>AM</name>
                              <description>Morning hour</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PM</name>
                              <description>Afternoon hour</description>
                              <value>0x10</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DAY</name>
                        <description>Day</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>MONTH</name>
                        <description>Month</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>YEAR</name>
                        <description>Year</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MASK</name>
                  <description>MODE2_ALARM Alarm n Mask</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SEL</name>
                        <description>Alarm Mask Selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>SELSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Alarm Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SS</name>
                              <description>Match seconds only</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MMSS</name>
                              <description>Match seconds and minutes only</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HHMMSS</name>
                              <description>Match seconds, minutes, and hours only</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DDHHMMSS</name>
                              <description>Match seconds, minutes, hours, and days only</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MMDDHHMMSS</name>
                              <description>Match seconds, minutes, hours, days, and months only</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>YYMMDDHHMMSS</name>
                              <description>Match seconds, minutes, hours, days, months, and years</description>
                              <value>0x6</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
